tutorialsDyM/RestingSphereMorphing/system/funkySetFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

expressions
 (
        alpha
        {
        field alpha.a; //field to initialise
        fields
        (
        z alpha
        );
        lookuptables (
        {
        name inletprofilealpha;
        outOfBounds clamp;
        file "$FOAM_CASE/1d_profil/alpha.a.xy";
        }
        );
        value uniform 0;
        expression "inletprofilealpha(pos().z+0.0025)";
        keepPatches 1;
        }   
 );

// ************************************************************************* //




